<?php

namespace Piro\Geocoder\Tests\Feature;

use Piro\Geocoder\Contracts\GeoProviders;
use Piro\Geocoder\Geocoder;
use Piro\Geocoder\Tests\TestCase;

class DadataProviderTest extends TestCase
{

    protected function getEnvironmentSetUp($app): void
    {
        parent::getEnvironmentSetUp($app);
        config(['geocoder.default' => GeoProviders::DADATA]);
    }

//    /** @test */
    public function it_can_geocode_address_via_dadata()
    {

        $geocoder = new Geocoder();

        $coords = [
            'Межводное Крым' => [45.585754, 32.841176],
            'Пицунда Абхазия' => [43.158758, 40.334922],
            'Мелитополь сво у нас' => [45.585754, 32.841176],
            'Цхинвал южная осетия которая теперь не грузия а россия' => [42.229352, 43.968432],
            'батуми' => [41.614506, 41.598636],
            'Финики это полужопа рядом с анталией в турции' => [36.315534, 30.157729],
            'в дубае' => [25.078822, 55.171641],
            'Абу-Даби' => [24.484887, 54.358540],
            'Дананг вьтнам' => [15.99678119828273, 108.26681435635467],
            'нянчанг' => [12.2425610811466, 109.19589906468104 ],
            'пхукет' => [7.830153317284963, 98.33053962533626],
            'бали' => [-8.58651561269218, 115.07118226842576],
            'станица динская точка на адресе' => [45.214247, 39.225090],
            'Дубай точка просто на пустом месте' => [25.224220, 55.276508],
            'адрес в краснодаре' => [45.041031, 39.020256],
            'санкт петербург адрес окраина' => [60.066917, 30.350579],
            'питер алрес центр' => [59.939789, 30.347875],
            'москва адрес' => [55.769655, 37.589112],
            'москва адрес центр' => [55.754436, 37.629475],
            'москва адрес коньково' => [55.644003, 37.525351],
            'люберцы адрес' => [55.677885, 37.892511],
        ];


        $result = [];

        foreach ($coords as $name => $coordsItem) {
            $address = $geocoder->reverse(...$coordsItem);
            $result[$name . ':' . implode(',', $coordsItem)] = $address->address;
        }
    }
}
